tutorials/immersedBoundary/backwardStepShortTurbulentSimpleIbFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//     p
//     {
//         solver           CG;
//         preconditioner   Cholesky;

//         minIter          1;
//         maxIter          1000;
//         tolerance        1e-06;
//         relTol           0.01;
//     }

//     p
//     {
//         solver           smoothSolver;
//         smoother         GaussSeidel;
//         nSweeps          10;

//         minIter          1;
//         maxIter          1000;
//         tolerance        1e-06;
//         relTol           0.01;
//     }

    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.05;
        minIter 1;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          1;
        maxIter          1000;
        tolerance        1e-06;
        relTol           0;
    }

    k
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          1;
        maxIter          1000;
        tolerance        1e-06;
        relTol           0;
    }

    epsilon
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          1;
        maxIter          1000;
        tolerance        1e-06;
        relTol           0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    pRefPoint (0.199 0.0299 0.001);
    pRefValue 0;
}

relaxationFactors
{
    U          0.7;
    p          0.3;
    k          0.6;
    epsilon    0.6;
}


// ************************************************************************* //
